PANDAS 37

#37: Seleksi baris dengan banyak kriteria pada Pandas data frame

In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

In [3]:
df = pd.read_csv('titanicfull.csv')
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [5]:
df[
    (df['Sex'] == 'female') &
    (df['Age'] >= 60) &
    (df['Embarked'] == 'S') &
    (df['Survival status'] == 1)
]

Empty DataFrame
Columns: [Pclass, Survival status, full Name, Sex, Age, Sib SP, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [9]:
kr1 = df['Sex'] == 'female'
kr2 = df['Age'] >= 60
kr3 = df['Embarked'] == 'S'
kr4 = df['Survival status'] == 1

df[kr1 & kr2 & kr3 & kr4]

Empty DataFrame
Columns: [Pclass, Survival status, full Name, Sex, Age, Sib SP, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

PANDAS 38

#38: Parameter header dan skiprows pada read_csv

In [ ]:
df = pd.read_csv('iris_error.csv')
df.head(8)

   sepal_length  sepal_width  petal_length  petal_width  target
0           5.1          3.5           1.4          0.2       0
1           4.9          3.0           1.4          0.2       0
2           4.7          3.2           1.3          0.2       0
3           6.4          3.2           4.5          1.5       1
4           6.9          3.1           4.9          1.5       1
5           6.3          3.3           6.0          2.5       2
6           5.8          2.7           5.1          1.9       2

In [18]:
df = pd.read_csv('iris_error.csv', header=2, skiprows=[5,6])
df.head()

   4.9  3.0  1.4  0.2  0
0  4.7  3.2  1.3  0.2  0
1  6.4  3.2  4.5  1.5  1
2  5.8  2.7  5.1  1.9  2

PANDAS 39

#39: Mengacak urutan baris pada Data Frame

In [20]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.5

In [21]:
n_rows = 6
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  1  2  4  3
1  2  1  4  4  2
2  1  2  1  4  4
3  1  1  1  4  3
4  2  1  1  2  3
5  1  4  1  4  1

In [22]:
df.sample(frac=1.0, random_state=1)

   A  B  C  D  E
2  1  2  1  4  4
1  2  1  4  4  2
4  2  1  1  2  3
0  2  1  2  4  3
3  1  1  1  4  3
5  1  4  1  4  1

In [24]:
df.sample(frac=1.0, random_state=1).reset_index(drop=True)

   A  B  C  D  E
0  1  2  1  4  4
1  2  1  4  4  2
2  2  1  1  2  3
3  2  1  2  4  3
4  1  1  1  4  3
5  1  4  1  4  1

PANDAS 40

#40: Akses sekelompok data pada Data Frame yang sudah terkelompok dengan get_group()

In [25]:
df = pd.read_csv('titanicfull.csv')
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [28]:
grouped_df = df.groupby('Sex')

In [29]:
grouped_df.get_group('female').head(10)

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S

In [31]:
grouped_df = df.groupby('Survival status')

In [32]:
grouped_df.get_group(1).head(10)

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S